NeekoNoNeko/Engineering_Competition/stm32f407vet6/Project/Project/BSP/OLED.c
/*********************工具函数*/


/*功能函数*********************/

/**
  * @brief  将OLED显存数组更新到OLED屏幕
  * 说    明：所有的显示函数，都只是对OLED显存数组进行读写
  *           随后调用OLED_Update函数或OLED_UpdateArea函数
  *           才会将显存数组的数据发送到OLED硬件，进行显示
  *           故调用显示函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  无
  * @retval 无
  */
void OLED_Update(void)
{
	uint8_t j;
	/*遍历每一页*/
	for (j = 0; j < 8; j ++)
	{
		/*设置光标位置为每一页的第一列*/
		OLED_SetCursor(j, 0);
		/*连续写入128个数据，将显存数组的数据写入到OLED硬件*/
		OLED_WriteData(OLED_DisplayBuf[j], 128);
	}
}

/**
  * @brief  将OLED显存数组部分更新到OLED屏幕
  * 说    明：此函数会至少更新参数指定的区域
  *           如果更新区域Y轴只包含部分页，则同一页的剩余部分会跟随一起更新
  * 说    明：所有的显示函数，都只是对OLED显存数组进行读写
  *           随后调用OLED_Update函数或OLED_UpdateArea函数
  *           才会将显存数组的数据发送到OLED硬件，进行显示
  *           故调用显示函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  X 指定区域左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
  * @param  Y 指定区域左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * @param  Width 指定区域的宽度，范围：0~128
  * @param  Height 指定区域的高度，范围：0~64
  * @retval 无
  */
void OLED_UpdateArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t j;
	int16_t Page, Page1;
	
	/*负数坐标在计算页地址时需要加一个偏移*/
	/*(Y + Height - 1) / 8 + 1的目的是(Y + Height) / 8并向上取整*/
	Page = Y / 8;
	Page1 = (Y + Height - 1) / 8 + 1;
	if (Y < 0)
	{
		Page -= 1;
		Page1 -= 1;
	}
	
	/*遍历指定区域涉及的相关页*/
	for (j = Page; j < Page1; j ++)
	{
		if (X >= 0 && X <= 127 && j >= 0 && j <= 7)		//超出屏幕的内容不显示
		{
			/*设置光标位置为相关页的指定列*/
			OLED_SetCursor(j, X);
			/*连续写入Width个数据，将显存数组的数据写入到OLED硬件*/
			OLED_WriteData(&OLED_DisplayBuf[j][X], Width);
		}
	}
}

/**
  * @brief  将OLED显存数组全部清零
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  无
  * @retval 无
  */
void OLED_Clear(void)
{
	uint8_t i, j;
	for (j = 0; j < 8; j ++)				//遍历8页
	{
		for (i = 0; i < 128; i ++)			//遍历128列
		{
			OLED_DisplayBuf[j][i] = 0x00;	//将显存数组数据全部清零
		}
	}
}

/**
  * @brief  将OLED显存数组部分清零
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  X 指定区域左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
  * @param  Y 指定区域左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * @param  Width 指定区域的宽度，范围：0~128
  * @param  Height 指定区域的高度，范围：0~64
  * @retval 无
  */
void OLED_ClearArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t i, j;
	
	for (j = Y; j < Y + Height; j ++)		//遍历指定页
	{
		for (i = X; i < X + Width; i ++)	//遍历指定列
		{
			if (i >= 0 && i <= 127 && j >=0 && j <= 63)				//超出屏幕的内容不显示
			{
				OLED_DisplayBuf[j / 8][i] &= ~(0x01 << (j % 8));	//将显存数组指定数据清零
			}
		}
	}
}

/**
  * @brief  将OLED显存数组全部取反
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  无
  * @retval 无
  */
void OLED_Reverse(void)
{
	uint8_t i, j;
	for (j = 0; j < 8; j ++)				//遍历8页
	{
		for (i = 0; i < 128; i ++)			//遍历128列
		{
			OLED_DisplayBuf[j][i] ^= 0xFF;	//将显存数组数据全部取反
		}
	}
}

/**
  * @brief  将OLED显存数组部分取反
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  X 指定区域左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
  * @param  Y 指定区域左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * @param  Width 指定区域的宽度，范围：0~128
  * @param  Height 指定区域的高度，范围：0~64
  * @retval 无
  */
void OLED_ReverseArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t i, j;
	
	for (j = Y; j < Y + Height; j ++)		//遍历指定页
	{
		for (i = X; i < X + Width; i ++)	//遍历指定列
		{
			if (i >= 0 && i <= 127 && j >=0 && j <= 63)			//超出屏幕的内容不显示
			{
				OLED_DisplayBuf[j / 8][i] ^= 0x01 << (j % 8);	//将显存数组指定数据取反
			}
		}
	}
}

/**
  * @brief  OLED显示一个字符
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  X 指定字符左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
  * @param  Y 指定字符左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * @param  Char 指定要显示的字符，范围：ASCII码可见字符
  * @param  FontSize 指定字体大小
  *           范围：OLED_8X16		宽8像素，高16像素
  *                 OLED_6X8		宽6像素，高8像素
  * @retval 无
  */
void OLED_ShowChar(int16_t X, int16_t Y, char Char, uint8_t FontSize)
{
	if (FontSize == OLED_8X16)		//字体为宽8像素，高16像素
	{
		/*将ASCII字模库OLED_F8x16的指定数据以8*16的图像格式显示*/
		OLED_ShowImage(X, Y, 8, 16, OLED_F8x16[Char - ' ']);
	}
	else if(FontSize == OLED_6X8)	//字体为宽6像素，高8像素
	{
		/*将ASCII字模库OLED_F6x8的指定数据以6*8的图像格式显示*/
		OLED_ShowImage(X, Y, 6, 8, OLED_F6x8[Char - ' ']);
	}
}

/**
  * @brief  OLED显示字符串
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  X 指定字符串左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
  * @param  Y 指定字符串左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * @param  String 指定要显示的字符串，范围：ASCII码可见字符组成的字符串
  * @param  FontSize 指定字体大小
  *           范围：OLED_8X16		宽8像素，高16像素
  *                 OLED_6X8		宽6像素，高8像素
  * @retval 无
  */
void OLED_ShowString(int16_t X, int16_t Y, char *String, uint8_t FontSize)
{
	uint8_t i;
	for (i = 0; String[i] != '\0'; i++)		//遍历字符串的每个字符
	{
		/*调用OLED_ShowChar函数，依次显示每个字符*/
		OLED_ShowChar(X + i * FontSize, Y, String[i], FontSize);
	}
}

/**
  * @brief  OLED显示数字（十进制，正整数）
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
  * @param  Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * @param  Number 指定要显示的数字，范围：0~4294967295
  * @param  Length 指定数字的长度，范围：0~10
  * @param  FontSize 指定字体大小
  *           范围：OLED_8X16		宽8像素，高16像素
  *                 OLED_6X8		宽6像素，高8像素
  * @retval 无
  */
void OLED_ShowNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	for (i = 0; i < Length; i++)		//遍历数字的每一位							
	{
		/*调用OLED_ShowChar函数，依次显示每个数字*/
		/*Number / OLED_Pow(10, Length - i - 1) % 10 可以十进制提取数字的每一位*/
		/*+ '0' 可将数字转换为字符格式*/
		OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
	}
}

/**
  * @brief  OLED显示有符号数字（十进制，整数）
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
  * @param  Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * @param  Number 指定要显示的数字，范围：-2147483648~2147483647
  * @param  Length 指定数字的长度，范围：0~10
  * @param  FontSize 指定字体大小
  *           范围：OLED_8X16		宽8像素，高16像素
  *                 OLED_6X8		宽6像素，高8像素
  * @retval 无
  */
void OLED_ShowSignedNum(int16_t X, int16_t Y, int32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	uint32_t Number1;
	
	if (Number >= 0)						//数字大于等于0
	{
		OLED_ShowChar(X, Y, '+', FontSize);	//显示+号
		Number1 = Number;					//Number1直接等于Number
	}
	else									//数字小于0
	{
		OLED_ShowChar(X, Y, '-', FontSize);	//显示-号
		Number1 = -Number;					//Number1等于Number取负
	}
	
	for (i = 0; i < Length; i++)			//遍历数字的每一位								
	{
		/*调用OLED_ShowChar函数，依次显示每个数字*/
		/*Number1 / OLED_Pow(10, Length - i - 1) % 10 可以十进制提取数字的每一位*/
		/*+ '0' 可将数字转换为字符格式*/
		OLED_ShowChar(X + (i + 1) * FontSize, Y, Number1 / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
	}
}

/**
  * @brief  OLED显示十六进制数字（十六进制，正整数）
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
  * @param  Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * @param  Number 指定要显示的数字，范围：0x00000000~0xFFFFFFFF
  * @param  Length 指定数字的长度，范围：0~8
  * @param  FontSize 指定字体大小
  *           范围：OLED_8X16		宽8像素，高16像素
  *                 OLED_6X8		宽6像素，高8像素
  * @retval 无
  */
void OLED_ShowHexNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i, SingleNumber;
	for (i = 0; i < Length; i++)		//遍历数字的每一位
	{
		/*以十六进制提取数字的每一位*/
		SingleNumber = Number / OLED_Pow(16, Length - i - 1) % 16;
		
		if (SingleNumber < 10)			//单个数字小于10
		{
			/*调用OLED_ShowChar函数，显示此数字*/
			/*+ '0' 可将数字转换为字符格式*/
			OLED_ShowChar(X + i * FontSize, Y, SingleNumber + '0', FontSize);
		}
		else							//单个数字大于10
		{
			/*调用OLED_ShowChar函数，显示此数字*/
			/*+ 'A' 可将数字转换为从A开始的十六进制字符*/
			OLED_ShowChar(X + i * FontSize, Y, SingleNumber - 10 + 'A', FontSize);
		}
	}
}

/**
  * @brief  OLED显示二进制数字（二进制，正整数）
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
  * @param  Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * @param  Number 指定要显示的数字，范围：0x00000000~0xFFFFFFFF
  * @param  Length 指定数字的长度，范围：0~16
  * @param  FontSize 指定字体大小
  *           范围：OLED_8X16		宽8像素，高16像素
  *                 OLED_6X8		宽6像素，高8像素
  * @retval 无
  */
void OLED_ShowBinNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	for (i = 0; i < Length; i++)		//遍历数字的每一位	
	{
		/*调用OLED_ShowChar函数，依次显示每个数字*/
		/*Number / OLED_Pow(2, Length - i - 1) % 2 可以二进制提取数字的每一位*/
		/*+ '0' 可将数字转换为字符格式*/
		OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(2, Length - i - 1) % 2 + '0', FontSize);
	}
}

/**
  * @brief  OLED显示浮点数字（十进制，小数）
  * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
  * @param  X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
  * @param  Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
  * @param  Number 指定要显示的数字，范围：-4294967295.0~4294967295.0
  * @param  IntLength 指定数字的整数位长度，范围：0~10
  * @param  FraLength 指定数字的小数位长度，范围：0~9，小数进行四舍五入显示
  * @param  FontSize 指定字体大小
  *           范围：OLED_8X16		宽8像素，高16像素
  *                 OLED_6X8		宽6像素，高8像素
  * @retval 无
  */
void OLED_ShowFloatNum(int16_t X, int16_t Y, double Number, uint8_t IntLength, uint8_t FraLength, uint8_t FontSize)
{
	uint32_t PowNum, IntNum, FraNum;
	
	if (Number >= 0)						//数字大于等于0
	{
		OLED_ShowChar(X, Y, '+', FontSize);	//显示+号
	}
	else									//数字小于0
	{
		OLED_ShowChar(X, Y, '-', FontSize);	//显示-号
		Number = -Number;					//Number取负
	}
	
